import './Reviews.scss';

import { useState } from 'react'
import babilia from '../../img/reviews/babilia.png'
import dendel from '../../img/reviews/dendel.png'
import erika from '../../img/reviews/erika.png'
import gnetilo from '../../img/reviews/gnetilo.png'
import inessa from '../../img/reviews/inessa.png'
import korposh from '../../img/reviews/korposh.png'
import mihailova from '../../img/reviews/mihailova.png'
import mydra from '../../img/reviews/mydra.png'
import povshik from '../../img/reviews/povshik.png'
import svitlana from '../../img/reviews/svitlana.png'
import typitsa from '../../img/reviews/typitsa.png'
import { useEffect } from 'react';

const mobileReviews = [
  {
    id: 1,
    name: 'Михайлова Анастасія',
    photo: mihailova,
    shortText: 'Ви чудовий педагог і людина своєї справи! За той час, що я навчалася з Вами я відчутно підняла рівень англійської. Чудовий підхід до занять і учнів. Кожне заняття це  занурення у світ англійської мови і культури.У 2017 році я вступила в .....',
    fullText: 'Ви чудовий педагог і людина своєї справи! За той час, що я навчалася з Вами я відчутно підняла рівень англійської. Чудовий підхід до занять і учнів. Кожне заняття це  занурення у світ англійської мови і культури.У 2017 році я вступила в Хмельницьку гуманітарно-педагогічну академію після здачі екзаменів, серед яких я також набрала хороший бал з англійської мови. Я завжди згадую уроки з Вами, коли їду за кордон. Завдяки тому, що ми не тільки вивчали граматику, а й розмовляли англійською, зараз я можу вести діалог з будь яким носієм англійської мови. Дякую Вам за плідну працю!',
  },

  {
    id: 2,
    name: 'Гнетило Віталій',
    photo: gnetilo,
    shortText: 'Хотів би похвалитись тим, як ви допомогли мені реалізувати себе! За ті декілька років, які я з вами займався, я підтягнув не лише англійську до неймовірного рівня,  а ще й отримав сотні порад від вас! Ви стали для мене не просто вчителем, а надійною людиною, яка ...',
    fullText: 'Хотів би похвалитись тим, як ви допомогли мені реалізувати себе! За ті декілька років, які я з вами займався, я підтягнув не лише англійську до неймовірного рівня,  а ще й отримав сотні порад від вас! Ви стали для мене не просто вчителем, а надійною людиною, яка могла дати пораду та підтримати у любій ситуації. Зараз я навчаюсь у Львові англійську і знаходжусь в групі B2+. Тому, можу сміло заявити, що навчання у вас дає змогу прокачати не лише англійську)) ',
  },
  {
    id: 3,
    name: 'Ян Бабіля',
    photo: babilia,
    shortText: 'Марія Кикина- це та людина яка не просто займалася зі мною репетиторством для підготовки до зно, коли я лише поступав в університет, а яка дала мені зерно самосвідомості про нашу країну, про те що війна з Росією почалася не з 2014 року, а ще з 1169 ....',
    fullText: 'Марія Кикина- це та людина яка не просто займалася зі мною репетиторством для підготовки до зно, коли я лише поступав в університет, а яка дала мені зерно самосвідомості про нашу країну, про те що війна з Росією почалася не з 2014 року, а ще з 1169 Розорення Києва, про цю кацапську напасть від якої ми відбиваємося ще з тих часів, що ми не якісь малороси, а нація, корені якої йдуть ще з давніх часів, і зараз я в лавах ЗСУ знищую ворога який зазіхнувся на саме дороге що є в нас українцях - волю. В неї хороший підхід до учнів і до навчання, вона хороший педагог і людина, тому всім хто хоче мати хороше пізнання в Історії і знати всі її тонкості то вам до неї, вивчайте історію, щоб знати за що ми боремося.',
  },
  {
    id: 4,
    name: 'Дендел Аня',
    photo: dendel,
    shortText: 'Це була моя НАЙКРАЩА вчителька з англійської мови( в мене їх було 6) і впринципі найкраща з усіх вчителів в моєму житті (їх було набагато більше). Я ходила до неї на додаткові заняття приблизно в випускних класах. В різні періоди я ходила до різних вчителів і залишилася в ...',
    fullText: 'Це була моя НАЙКРАЩА вчителька з англійської мови( в мене їх було 6) і впринципі найкраща з усіх вчителів в моєму житті (їх було набагато більше). Я ходила до неї на додаткові заняття приблизно в випускних класах. В різні періоди я ходила до різних вчителів і залишилася в Марії через її підхід до навчання. Навіть якщо ми не проходили багато на уроці і в мене не було колосальних домашніх завдань, то мій розвиток з англ мови проходив набагато швидше ніж з іншими вчителями. Різні письмові, відео і аудіо завдання, теми слів в різних сферах життя, карточки, ігри, пісні, фільми - все це і не тільки було частиною нашого навчання. В залежності від цілі навчання змінювались методи й завдання, і коли мені потрібно було готуватись до ВИПУСКНИХ ЕКЗАМЕНІВ то ми направили всі сили на це, і хоч я трохи лінива людина і не виконувала всіх поставлених задач то я всеодно змогла здати екзамени на набагато вищу оцінку ніж очікувала. Екзамени мені здалися дуже легкими і я їй дуже вдячна за все. Коли в мене буде дитина то я з спокіною душею віддам її до цього прекрасного вчителя і буду знати що вона в надійних руках. Також рекламую її для всіх знайомих так як вона залишила в мені незабутні емоції і враження, ніяких слів подяки не вистачить щоб це передати.',
  },
  {
    id: 5,
    name: 'Еріка',
    photo: erika,
    shortText: 'Хочу поділитись досвідом вивчення англійської мови з прекрасним викладачем. Чому саме вона? Весела, цікава, інноваційна, найкраща викладачка, яка не тільки вчить, а й мотивує своїх учнів до вивчення мови. Завжди враховує ваші інтереси, підтримає та підкаже ...',
    fullText: 'Хочу поділитись досвідом вивчення англійської мови з прекрасним викладачем. Чому саме вона? Весела, цікава, інноваційна, найкраща викладачка, яка не тільки вчить, а й мотивує своїх учнів до вивчення мови. Завжди враховує ваші інтереси, підтримає та підкаже куди саме вам рухатись. Дійсно всім раджу, обираючи саме її, ви отримаєте корисні поради, цікаві історії і приємні спогади, які запамятаються вам на все життя.',
  },
  {
    id: 6,
    name: 'Інесса',
    photo: inessa,
    shortText: 'Знайомі з Машою вже давно, ця дівчинка зразу зробила велике враження на мене , своїм не традиційним викладанням навчального матеріалу. Уроки з нею завжди проходять в затишній обстановці, легко, весело. Це підтвердять всі хто хоч раз побувавши в неї на ...',

    fullText: 'Знайомі з Машою вже давно, ця дівчинка зразу зробила велике враження на мене , своїм не традиційним викладанням навчального матеріалу. Уроки з нею завжди проходять в затишній обстановці, легко, весело. Це підтвердять всі хто хоч раз побувавши в неї на уроках. Вона неймовірна , її позитив завжди піднімає мені настрій, а ще дуже люблю її за те, що підтримує мене завжди так щиро  вона вірить в мене більше ніж я сама в себе …. Її уроки проходять насичені корисними знаннями.   /n  Завжди нові матеріали в «не нудній» формі викладу , за найсучаснішими методами викладання  тут можна багато розповідати, наскільки вона старається для кожного Вона чудовий , найкращий - вчить, і подруга Вважаю, що вчителями не стають – ними народжуються, це про Марічку Кикину!',

  },

  {
    id: 7,
    name: 'Тупиця Вікторія',
    photo: typitsa,
    shortText: 'За весь час навчання у ВПУ N34 м.Виноградів, найбільше з вчителів мені запамʼяталася Марія Кикина. Ці всі спогади наповненні теплотою, від згадки про веселі, цікаві та корисні уроки, де в процесі навчання всі учні беруть участь, без страху висловити свою ...',
    fullText: 'За весь час навчання у ВПУ N34 м.Виноградів, найбільше з вчителів мені запамʼяталася Марія Кикина. Ці всі спогади наповненні теплотою, від згадки про веселі, цікаві та корисні уроки, де в процесі навчання всі учні беруть участь, без страху висловити свою особисту думку. Хочу відзначити Марію Олександрівну, як прекрасного професіонала, яка з легкістю пояснює складні речі простими словами, її підтримку на всіх етапах мого студентського життя. І щиро хочу подякувати за той безцінний досвід та засвоєнні знання, які допомагають мені досягати поставлених цілей у професійній діяльності.',
  },
  {
    id: 8,
    name: 'Корпош Володимир',
    photo: korposh,
    shortText: 'На уроки завжди йшов з задоволенням! Це вчителька - завдяки якій хотілося вивчати англійську мову адже іноді зовсім мало бажання учня, потрібно і заохочення від наставника, заняття проходили дуже цікаво, весело і саме головне ... ',
    fullText: 'На уроки завжди йшов з задоволенням! Це вчителька - завдяки якій хотілося вивчати англійську мову адже іноді зовсім мало бажання учня, потрібно і заохочення від наставника, заняття проходили дуже цікаво, весело і саме головне  - корисно після завершення розумів що вийшов з класу «з чимось новим». /n   Спасибі Вам за все! ',
  },
  {
    id: 9,
    name: 'Світлана',
    photo: svitlana,
    shortText: 'Займалася з викладачем близько року. Мені дуже сподобалось! Марія - хороший фахівець, який вміє знайти підхід до учнів, цікава, позитивна та приємна, захоплююче подає матеріал. На уроках багато розмовляли англійською, обговорювали ...',
    fullText: 'Займалася з викладачем близько року. Мені дуже сподобалось! Марія - хороший фахівець, який вміє знайти підхід до учнів, цікава, позитивна та приємна, захоплююче подає матеріал. На уроках багато розмовляли англійською, обговорювали, опрацьовували теми та сміялись.',
  },

  {
    id: 10,
    name: 'Повшик Вікторія',
    photo: povshik,
    shortText: 'Марія Олександрівна дуже хороший викладач  і справжній професіонал своєї справи. Дуже гарно дякую вам за вашу допомогу у підготовці до НМТ та за вашу підтримку. Дякую вам за вашу працю. Ви-найкраща!',
    fullText: 'Марія Олександрівна дуже хороший викладач  і справжній професіонал своєї справи. Дуже гарно дякую вам за вашу допомогу у підготовці до НМТ та за вашу підтримку. Дякую вам за вашу працю. Ви-найкраща!',
  },
  {
    id: 11,
    name: 'Мудра Надія',
    photo: mydra,
    shortText: 'Про Марію Олександрівну можу сказати тільки хороше, найкращий вчитель який завжди знайде підхід до кожного учня. Дає можливість більше дізнатися про іноземні мови.',
    fullText: 'Про Марію Олександрівну можу сказати тільки хороше, найкращий вчитель який завжди знайде підхід до кожного учня. Дає можливість більше дізнатися про іноземні мови.',
  },

]

const tableReviews = [
  {
    id: 1,
    name: 'Михайлова Анастасія',
    photo: mihailova,
    text: 'Ви чудовий педагог і людина своєї справи! За той час, що я навчалася з Вами я відчутно підняла рівень англійської. Чудовий підхід до занять і учнів. Кожне заняття це  занурення у світ англійської мови і культури.У 2017 році я вступила в Хмельницьку гуманітарно-педагогічну академію після здачі екзаменів, серед яких я також набрала хороший бал з англійської мови. Я завжди згадую уроки з Вами, коли їду за кордон. Завдяки тому, що ми не тільки вивчали граматику, а й розмовляли англійською, зараз я можу вести діалог з будь яким носієм англійської мови. Дякую Вам за плідну працю!',
  },

  {
    id: 2,
    name: 'Гнетило Віталій',
    photo: gnetilo,
    text: 'Хотів би похвалитись тим, як ви допомогли мені реалізувати себе! За ті декілька років, які я з вами займався, я підтягнув не лише англійську до неймовірного рівня,  а ще й отримав сотні порад від вас! Ви стали для мене не просто вчителем, а надійною людиною, яка могла дати пораду та підтримати у любій ситуації. Зараз я навчаюсь у Львові англійську і знаходжусь в групі B2+. Тому, можу сміло заявити, що навчання у вас дає змогу прокачати не лише англійську)) ',
  },

  {
    id: 3,
    name: 'Еріка',
    photo: erika,
    text: 'Хочу поділитись досвідом вивчення англійської мови з прекрасним викладачем. Чому саме вона? Весела, цікава, інноваційна, найкраща викладачка, яка не тільки вчить, а й мотивує своїх учнів до вивчення мови. Завжди враховує ваші інтереси, підтримає та підкаже куди саме вам рухатись. Дійсно всім раджу, обираючи саме її, ви отримаєте корисні поради, цікаві історії і приємні спогади, які запамятаються вам на все життя.',
  },

  {
    id: 4,
    name: 'Ян Бабіля',
    photo: babilia,
    text: 'Марія Кикина- це та людина яка не просто займалася зі мною репетиторством для підготовки до зно, коли я лише поступав в університет, а яка дала мені зерно самосвідомості про нашу країну, про те що війна з Росією почалася не з 2014 року, а ще з 1169 Розорення Києва, про цю кацапську напасть від якої ми відбиваємося ще з тих часів, що ми не якісь малороси, а нація, корені якої йдуть ще з давніх часів, і зараз я в лавах ЗСУ знищую ворога який зазіхнувся на саме дороге що є в нас українцях - волю. В неї хороший підхід до учнів і до навчання, вона хороший педагог і людина, тому всім хто хоче мати хороше пізнання в Історії і знати всі її тонкості то вам до неї, вивчайте історію, щоб знати за що ми боремося.',
  },

  {
    id: 5,
    name: 'Дендел Аня',
    photo: dendel,
    text: 'Це була моя НАЙКРАЩА вчителька з англійської мови( в мене їх було 6) і впринципі найкраща з усіх вчителів в моєму житті (їх було набагато більше). Я ходила до неї на додаткові заняття приблизно в випускних класах. В різні періоди я ходила до різних вчителів і залишилася в Марії через її підхід до навчання. Навіть якщо ми не проходили багато на уроці і в мене не було колосальних домашніх завдань, то мій розвиток з англ мови проходив набагато швидше ніж з іншими вчителями. Різні письмові, відео і аудіо завдання, теми слів в різних сферах життя, карточки, ігри, пісні, фільми - все це і не тільки було частиною нашого навчання. В залежності від цілі навчання змінювались методи й завдання, і коли мені потрібно було готуватись до ВИПУСКНИХ ЕКЗАМЕНІВ то ми направили всі сили на це, і хоч я трохи лінива людина і не виконувала всіх поставлених задач то я всеодно змогла здати екзамени на набагато вищу оцінку ніж очікувала. Екзамени мені здалися дуже легкими і я їй дуже вдячна за все. Коли в мене буде дитина то я з спокіною душею віддам її до цього прекрасного вчителя і буду знати що вона в надійних руках. Також рекламую її для всіх знайомих так як вона залишила в мені незабутні емоції і враження, ніяких слів подяки не вистачить щоб це передати.',
  },

  {
    id: 6,
    name: 'Інесса',
    photo: inessa,
    text: 'Знайомі з Машою вже давно, ця дівчинка зразу зробила велике враження на мене , своїм не традиційним викладанням навчального матеріалу. Уроки з нею завжди проходять в затишній обстановці, легко, весело. Це підтвердять всі хто хоч раз побувавши в неї на уроках. Вона неймовірна , її позитив завжди піднімає мені настрій, а ще дуже люблю її за те, що підтримує мене завжди так щиро  вона вірить в мене більше ніж я сама в себе …. Її уроки проходять насичені корисними знаннями.   /n  Завжди нові матеріали в «не нудній» формі викладу , за найсучаснішими методами викладання  тут можна багато розповідати, наскільки вона старається для кожного Вона чудовий , найкращий - вчить, і подруга Вважаю, що вчителями не стають – ними народжуються, це про Марічку Кикину!',
  },

  {
    id: 7,
    name: 'Мудра Надія',
    photo: mydra,
    text: 'Про Марію Олександрівну можу сказати тільки хороше, найкращий вчитель який завжди знайде підхід до кожного учня. Дає можливість більше дізнатися про іноземні мови.',
  },

  {
    id: 8,
    name: 'Повшик Вікторія',
    photo: povshik,
    text: 'Марія Олександрівна дуже хороший викладач  і справжній професіонал своєї справи. Дуже гарно дякую вам за вашу допомогу у підготовці до НМТ та за вашу підтримку. Дякую вам за вашу працю. Ви-найкраща!',
  },

  {
    id: 9,
    name: 'Тупиця Вікторія',
    photo: typitsa,
    text: 'За весь час навчання у ВПУ N34 м.Виноградів, найбільше з вчителів мені запамʼяталася Марія Кикина. Ці всі спогади наповненні теплотою, від згадки про веселі, цікаві та корисні уроки, де в процесі навчання всі учні беруть участь, без страху висловити свою особисту думку. Хочу відзначити Марію Олександрівну, як прекрасного професіонала, яка з легкістю пояснює складні речі простими словами, її підтримку на всіх етапах мого студентського життя. І щиро хочу подякувати за той безцінний досвід та засвоєнні знання, які допомагають мені досягати поставлених цілей у професійній діяльності.',
  },

  {
    id: 10,
    name: 'Світлана',
    photo: svitlana,
    text: 'Займалася з викладачем близько року. Мені дуже сподобалось! Марія - хороший фахівець, який вміє знайти підхід до учнів, цікава, позитивна та приємна, захоплююче подає матеріал. На уроках багато розмовляли англійською, обговорювали, опрацьовували теми та сміялись.',
  },

  {
    id: 11,
    name: 'Корпош Володимир',
    photo: korposh,
    text: 'На уроки завжди йшов з задоволенням! Це вчителька - завдяки якій хотілося вивчати англійську мову адже іноді зовсім мало бажання учня, потрібно і заохочення від наставника, заняття проходили дуже цікаво, весело і саме головне  - корисно після завершення розумів що вийшов з класу «з чимось новим». /n   Спасибі Вам за все! ',
  },
]

export const Reviews = () => {
  const [isFullText, setIsFullText] = useState(null);
  const [windowWidth, setWindowWidth] = useState(window.innerWidth);


  const openText = (id) => {
    if (isFullText === id) {
      setIsFullText(null);
      return
    }

    setIsFullText(id);
  }

  useEffect(() => {
    const handleResize = () => {
      setWindowWidth(window.innerWidth);
    };

    window.addEventListener('resize', handleResize);

    return () => {
      window.removeEventListener('resize', handleResize);
    };
  }, []);

  useEffect(() => {
    if (windowWidth >= 768) {
      setIsFullText(null)
    }
  }, [windowWidth])
  return (
    <section className="page__section reviews">
      <div className="container">
        <h2 className="page__title">
          Відгуки
        </h2>
        <div className="reviews__content">
          {
            windowWidth < 768 && (
              mobileReviews.map(reviewers => (
                <div key={reviewers.id} className="reviews__item ">
                  <div className="reviews__info">
                    <img
                      src={reviewers.photo}
                      alt={reviewers.name}
                      className="reviews__photo"
                    />
                    <p className="reviews__name">
                      {reviewers.name}
                    </p>
                  </div>
                  <p
                    className="reviews__text"
                    onClick={() => openText(reviewers.id)}
                  >
                    {

                      isFullText === reviewers.id ? (
                        reviewers.fullText
                      ) : (
                        reviewers.shortText
                      )
                    }
                  </p>
                </div>
              ))
            )
          }
          {
            windowWidth > 768 && (
              tableReviews.map(reviewers => (
                <div key={reviewers.id} className="reviews__item ">
                  <div className="reviews__info">
                    <img
                      src={reviewers.photo}
                      alt={reviewers.name}
                      className="reviews__photo"
                    />
                    <p className="reviews__name">
                      {reviewers.name}
                    </p>
                  </div>
                  <p
                    className="reviews__text"
                  >
                    {
                      reviewers.text
                    }
                  </p>
                </div>
              ))
            )

          }

        </div>
      </div>
    </section>
  )
}
